app/Controllers/Donaciones.php

SELECT `idProyectos`, `nombreProyecto`
FROM `proyectos`
SELECT `idDatosResponsable`, `nombreCompleto`, `tipoAsociado`
FROM `datos_responsable`
---
    public function create()
    {
        $db = \Config\Database::connect();
        $projectBuilder = $db->table('proyectos');
       $projectBuilder->select('idProyectos, nombreProyecto');
       $projectBuilder->where('estado !=', 'Eliminado')->Where('estado !=', 'Inactivo');
       $proyectos = $projectBuilder->get()->getResult();

        $responsableBuilder = $db->table('datos_responsable');
         $responsableBuilder->select('idDatosResponsable, nombreCompleto, estado, tipoAsociado');
         $responsableBuilder->where('estado =', 'Activo'); // estado de persona
         $responsables = $responsableBuilder->get()->getResult();

INSERT INTO `donaciones` (`cantidad`, `cantidadLetras`, `fechaDonacion`, `descripcion`, `estado`, `idProyectos`, `idDatosResponsable`) VALUES ('63', 'sesenta y tres', '2025-01-09', 'donacion', 'Activo', '3', '35')
SELECT `valorActual`
FROM `proyectos`
WHERE `idProyectos` = '3'
UPDATE `proyectos` SET `valorActual` = 63
WHERE `idProyectos` = '3'
---
    public function store()
    {
        $request = \Config\Services::request();
        $donacionModel = new DonacionesModel();

        $data = [

            'cantidad' => $request->getVar('cantidad'),
            'cantidadLetras' => $request->getVar('cantidadLetras'), // Corregido aquí
            'fechaDonacion' => $request->getVar('fecha'),
            'descripcion' => $request->getVar('descripcion'),
            'estado' => "Activo",
            'idProyectos' => $request->getVar('idProyecto'),
            'idDatosResponsable' => $request->getVar('NombreDonante')
        ];

        $donacionModel->insert($data);

        $db = \Config\Database::connect();
        $projectBuilder = $db->table('proyectos');
        $projectBuilder->select('valorActual')->where('idProyectos', $request->getVar('idProyecto'));
        $vActual = $projectBuilder->get()->getRow()->valorActual;


        $nuevoValor = $vActual + ($request->getVar('cantidad'));

        $data = [
            'valorActual' => $nuevoValor
        ];

        $projectBuilder->where('idProyectos', $request->getVar('idProyecto'))->update($data);

SELECT `donaciones`.`idDonaciones`, `datos_responsable`.`nombreCompleto`, `donaciones`.`cantidadLetras`, `donaciones`.`cantidad`, `donaciones`.`descripcion`, `donaciones`.`fechaDonacion`, `proyectos`.`nombreProyecto`
FROM `donaciones`
INNER JOIN `proyectos` ON `proyectos`.`idProyectos` = `donaciones`.`idProyectos`
INNER JOIN `datos_responsable` ON `datos_responsable`.`idDatosResponsable` = `donaciones`.`idDatosResponsable`
WHERE `idDonaciones` = '2'
---
    public function GenerarTicket($id)
    {
        $dompdf = new Dompdf();
        //$dompdf->loadHTML('<h1>Hola Mundo</h1><br><p>Otro contenido</p>');
        $db = \Config\Database::connect();
        $builder = $db->table('donaciones');
        $builder->select('donaciones.idDonaciones, datos_responsable.nombreCompleto, donaciones.cantidadLetras, donaciones.cantidad, donaciones.descripcion, donaciones.fechaDonacion, proyectos.nombreProyecto' );
        $builder->join('proyectos', 'proyectos.idProyectos = donaciones.idProyectos', 'inner');
        $builder->join('datos_responsable', 'datos_responsable.idDatosResponsable = donaciones.idDatosResponsable', 'inner');
        $donaciones = $builder->where('idDonaciones', $id)->get()->getResult();