app/Controllers/Home.php

    public function index(): string
    {
        $db = \Config\Database::connect();
        $projectBuilder = $db->table('proyectos');
        $proyectos = $projectBuilder->select('idProyectos', 'nombreProyecto','estado','meta','valorActual')->get()->getResult();
---
SELECT `idProyectos`
FROM `proyectos`

    public function getMetas()
    {
        $db = \Config\Database::connect();
        $projectBuilder = $db->table('proyectos');
        //$proyectos = $projectBuilder->select('idProyectos', 'nombreProyecto','estado','meta','valorActual')->get()->getResult();
        $metas = $projectBuilder->select(['nombreProyecto', 'meta', 'valorActual'])->where('anio', 2024)->get()->getResult();
---
SELECT `nombreProyecto`, `meta`, `valorActual`
FROM `proyectos`
WHERE `anio` = 2024