app/Controllers/Padres.php

    public function index()
    {
        $pager = \Config\Services::pager();
        $padreModel = new PadreModel();
        $tipoDocumentoModel = new TipoDocumentoModel();
        $request = \Config\Services::request();

        // Paginación
        $currentPage = $request->getVar('page') ?? 1;
        $perPage = 5;
        $offset = ($currentPage - 1) * $perPage;

        // Obtener filtros de la solicitud
        $filters = [
            'nombre_completo' => $request->getVar('nombre_completo'),
            'tipo_documento' => $request->getVar('tipo_documento'),
            'genero' => $request->getVar('genero'),
            'estado' => $request->getVar('estado') !== null ? $request->getVar('estado') : '', // Agregar filtro de estado si es necesario
        ];

        // Total de filas con filtros aplicados
        $totalRows = $padreModel->countFilteredPadres($filters);

        // Obtener datos paginados
        $padres = $padreModel->getFilteredPadres($filters, $perPage, $offset);

        // Obtener los tipos de documento
        $tiposDocumento = $tipoDocumentoModel->findAll();
---
SELECT *
FROM `tipo_documento`