app/Controllers/Padres.php

INSERT INTO `responsable_alumno` (`idDatosResponsable`, `idAlumno`) VALUES ('17', 28)
---

                // Asociar nuevo alumno al padre
                $responsableAlumnoModel = new ResponsableAlumnoModel();
                $responsableAlumnoModel->insert([
                    'idDatosResponsable' => $id,
                    'idAlumno' => $nuevoAlumnoId,
                ]);