app/Controllers/PermisoMagisterial.php

SELECT *
FROM `tipo_permisos`
---
    public function create()
    {
        helper('form');

        $modelMaestro = new MaestroModel();
        $data['maestros'] = $modelMaestro->findAll();

        $modelTipoPermiso = new TipoPermisoModel();
        $data['tipos_permisos'] = $modelTipoPermiso->findAll();