app/Controllers/Proyectos.php

    public function index()
    {

        $model = new ProyectosModel();
        $data['proyectos'] = $model->where('estado !=', 'Eliminado')->findAll();
---
SELECT *
FROM `proyectos`
WHERE `estado` != 'Eliminado'