app/Controllers/RegistroDiarioController.php

    public function index()
    {
        $registroDiarioModel = new RegistroDiarioModel();
        $detalleAsistenciaModel = new DetalleAsistenciaModel();

        // Obtener los registros con información relacionada
        $data['registros'] = $registroDiarioModel
            ->select('registro_diario.idRegistroDiario, registro_diario.fecha,
                      COALESCE(SUM(detalle_asistencia.Total), 0) as familiasBeneficiadas')
            ->join('detalle_asistencia', 'detalle_asistencia.idRegistroDiario = registro_diario.idRegistroDiario', 'left')
            ->groupBy('registro_diario.idRegistroDiario, registro_diario.fecha')
            ->paginate(10);
---
SELECT COUNT(*) AS `numrows`
FROM (
SELECT `registro_diario`.`idRegistroDiario`, `registro_diario`.`fecha`, COALESCE(SUM(detalle_asistencia.Total), 0) as familiasBeneficiadas
FROM `registro_diario`
LEFT JOIN `detalle_asistencia` ON `detalle_asistencia`.`idRegistroDiario` = `registro_diario`.`idRegistroDiario`
GROUP BY `registro_diario`.`idRegistroDiario`, `registro_diario`.`fecha`
) CI_count_all_results
SELECT `registro_diario`.`idRegistroDiario`, `registro_diario`.`fecha`, COALESCE(SUM(detalle_asistencia.Total), 0) as familiasBeneficiadas
FROM `registro_diario`
LEFT JOIN `detalle_asistencia` ON `detalle_asistencia`.`idRegistroDiario` = `registro_diario`.`idRegistroDiario`
GROUP BY `registro_diario`.`idRegistroDiario`, `registro_diario`.`fecha`
 LIMIT 10