app/Controllers/SolicitudProductos.php

SELECT *
FROM `productos_ingresos`
---
    public function index()
    {
        $productoIngresoModel = new ProductosIngresosModel();

        $data = [
            'solicitudesIngreso' => $productoIngresoModel->findAll()
        ];