app/Controllers/SolicitudProductos.php

INSERT INTO `consumos` (`idProducto`, `saldo_inicial`, `salidas`, `saldo`, `fecha`) VALUES ('4', '140', 30, 110, '2024-08-01')
---
    protected function registrarSalida($idProducto, $cantidad, $fecha)
    {
        $consumoModel = new ConsumoModel();

        $data = [
            'idProducto' => $idProducto,
            'cantidad' => $cantidad,
            'fecha' => $fecha,
            'tipo' => 'salida'
        ];

        $consumoModel->insert($data);