app/Controllers/TipoPermiso.php

    public function index()
    {
        $tipos_permisos = $this->tipoPermisoModel->findAll();
---
SELECT *
FROM `tipo_permisos`