app/Controllers/TipoProducto.php

SELECT *
FROM `tipo_producto`
---
    public function index()
    {
        $model = new TipoProductoModel();
        $tiposProducto = $model->findAll();