app/Controllers/TipoDocumentoController.php

SELECT *
FROM `tipo_documento`
WHERE `estado` != 'Eliminado'
---
    public function index()
    {
         // Recuperar solo los documentos que no estén eliminados
    $data['tiposDocumento'] = $this->tipoDocumentoModel->where('estado !=', 'Eliminado')->findAll();