app/Controllers/Usuario.php

    public function create()
    {
        $db = \Config\Database::connect();


        // Obtener la lista de roles
        $rolesBuilder = $db->table('rol');
        $roles = $rolesBuilder->select('idRol, nombreRol')->get()->getResult();
---
SELECT `idRol`, `nombreRol`
FROM `rol`