app/Models/ConsumoModel.php

SELECT *
FROM `consumos`
WHERE `idProducto` = '4'
ORDER BY `fecha` DESC
 LIMIT 1
---
    public function obtenerUltimoConsumo($idProducto)
    {
        return $this->where('idProducto', $idProducto)
                    ->orderBy('fecha', 'DESC')
                    ->first();  // Use 'first' to get the latest record