app/Models/PadreModel.php

SELECT *
FROM `datos_responsable`
---
    public function getDatosResponsableWithTipoDocumento($idDatosResponsable = null)
    {
        $builder = $this->db->table($this->table);
        $builder->select('datos_responsable.*, tipo_documento.nombre as tipo_documento, tipo_documento.mascara');
        $builder->join('tipo_documento', 'tipo_documento.idTipoDocumento = datos_responsable.idTipoDocumento', 'left');

        if ($idDatosResponsable) {
            $builder->where('datos_responsable.idDatosResponsable', $idDatosResponsable);
            return $builder->get()->getRowArray();
        }

        return $builder->get()->getResultArray();

SELECT COUNT(*) AS `numrows`
FROM `datos_responsable`
WHERE `estado` != 'inactivo'
---
    public function countFilteredPadres($filters)
    {
        $builder = $this->db->table($this->table);

        // Aplicar los mismos filtros que en el método de obtención de datos
        if (!empty($filters['nombre_completo'])) {
            $builder->like('nombreCompleto', $filters['nombre_completo']);
        }
        if (!empty($filters['tipo_documento'])) {
            $builder->where('datos_responsable.idTipoDocumento', $filters['tipo_documento']); // Calificar la columna
        }
        if (!empty($filters['genero'])) {
            $builder->where('genero', $filters['genero']);
        }

        // Eliminar el filtro de estado para que cuente ambos, activos e inactivos
        if (isset($filters['estado']) && $filters['estado'] !== '') {
            $builder->where('estado', $filters['estado']);
        }

        // Excluir registros con estado 'Eliminado'
        $builder->where('estado !=', 'Eliminado');

        return $builder->countAllResults();