app/Models/PermisosPersonalModel.php

SELECT `permisos_personal`.*, `docente`.`nip`, `docente`.`nombre_completo`, `saldos_personal`.`saldoActualDias`, `saldos_personal`.`saldoActualHoras`, `tipo_permisos`.`nombre` as `tipoPermisoNombre`, `tipo_permisos`.`cantidad_dias`
FROM `permisos_personal`
JOIN `saldos_personal` ON `saldos_personal`.`idSaldoPersonal` = `permisos_personal`.`idSaldoPersonal`
JOIN `docente` ON `docente`.`idDocente` = `saldos_personal`.`idDocente`
JOIN `tipo_permisos` ON `tipo_permisos`.`idTipoPermiso` = `saldos_personal`.`idTipoPermiso`
ORDER BY `permisos_personal`.`fechaCreacion` DESC, `permisos_personal`.`fechaCreacion` DESC
---
    public function getPermisosConSaldos($nombreCompleto = null, $nip = null, $fechaCreacion = null)
    {
        $builder = $this->db->table('permisos_personal');
        $builder->select('permisos_personal.*, docente.nip, docente.nombre_completo, saldos_personal.saldoActualDias, saldos_personal.saldoActualHoras, tipo_permisos.nombre as tipoPermisoNombre, tipo_permisos.cantidad_dias');
        $builder->join('saldos_personal', 'saldos_personal.idSaldoPersonal = permisos_personal.idSaldoPersonal');
        $builder->join('docente', 'docente.idDocente = saldos_personal.idDocente');
        $builder->join('tipo_permisos', 'tipo_permisos.idTipoPermiso = saldos_personal.idTipoPermiso');
        $builder->orderBy('permisos_personal.fechaCreacion', 'DESC'); // Ordenar por fecha de creación

            // Aplicar filtros
        if ($nombreCompleto) {
            $builder->like('docente.nombre_completo', $nombreCompleto);
        }
        if ($nip) {
            $builder->where('docente.nip', $nip);
        }
        if ($fechaCreacion) {
            $builder->where('permisos_personal.fechaCreacion', $fechaCreacion);
        }

        $builder->orderBy('permisos_personal.fechaCreacion', 'DESC');

        return $builder->get()->getResultArray();

SELECT `permisos_personal`.*, `docente`.`nip`, `docente`.`nombre_completo`, `saldos_personal`.`saldoActualDias`, `saldos_personal`.`saldoActualHoras`, `tipo_permisos`.`nombre` as `tipoPermisoNombre`, `tipo_permisos`.`cantidad_dias`, `permisos_personal`.`fechaInicio`, `permisos_personal`.`fechaFin`
FROM `permisos_personal`
JOIN `saldos_personal` ON `saldos_personal`.`idSaldoPersonal` = `permisos_personal`.`idSaldoPersonal`
JOIN `docente` ON `docente`.`idDocente` = `saldos_personal`.`idDocente`
JOIN `tipo_permisos` ON `tipo_permisos`.`idTipoPermiso` = `saldos_personal`.`idTipoPermiso`
ORDER BY `permisos_personal`.`fechaCreacion` DESC
---
    public function getReportePermisos($fechaInicio = null, $fechaFin = null)
{
    $builder = $this->db->table('permisos_personal');
    $builder->select('
        permisos_personal.*,
        docente.nip,
        docente.nombre_completo,
        saldos_personal.saldoActualDias,
        saldos_personal.saldoActualHoras,
        tipo_permisos.nombre as tipoPermisoNombre,
        tipo_permisos.cantidad_dias,
        permisos_personal.fechaInicio,
        permisos_personal.fechaFin
    ');
    $builder->join('saldos_personal', 'saldos_personal.idSaldoPersonal = permisos_personal.idSaldoPersonal');
    $builder->join('docente', 'docente.idDocente = saldos_personal.idDocente');
    $builder->join('tipo_permisos', 'tipo_permisos.idTipoPermiso = saldos_personal.idTipoPermiso');
    $builder->orderBy('permisos_personal.fechaCreacion', 'DESC'); // Ordenar por fecha de creación

    // Filtrar por fechaInicio si se proporciona
    if ($fechaInicio) {
        $builder->where('fechaInicio >=', $fechaInicio);
    }

    // Filtrar por fechaFin si se proporciona
    if ($fechaFin) {
        $builder->where('fechaFin <=', $fechaFin);
    }

    // Obtener los resultados
    return $builder->get()->getResultArray();