app/Models/PermisosPersonalModel.php

    public function getPermisosPorDocente($idDocente)
    {
        $builder = $this->db->table('permisos_personal p');
        $builder->select('p.idPermisoPersonal, p.fechaInicio, p.fechaFin, p.horasSolicitadas, p.saldoHistorialDias, p.saldoHistorialHoras, s.saldoActualDias, s.saldoActualHoras, tp.nombre as tipoPermisoNombre, tp.cantidad_dias');
        $builder->join('saldos_personal s', 'p.idSaldoPersonal = s.idSaldoPersonal');
        $builder->join('tipo_permisos tp', 'tp.idTipoPermiso = s.idTipoPermiso');
        $builder->where('s.idDocente', $idDocente);
        $builder->orderBy('p.fechaCreacion', 'DESC'); // Ordenar por fecha de creación

        $query = $builder->get();
---
SELECT `permisos_personal`.*, `docente`.`nip`, `docente`.`nombreCompleto`, `saldos_personal`.`saldoActualDias`, `saldos_personal`.`saldoActualHoras`, `tipo_permisos`.`nombre` as `tipoPermisoNombre`, `tipo_permisos`.`cantidadDias`
FROM `permisos_personal`
JOIN `saldos_personal` ON `saldos_personal`.`idSaldoPersonal` = `permisos_personal`.`idSaldoPersonal`
JOIN `docente` ON `docente`.`idDocente` = `saldos_personal`.`idDocente`
JOIN `tipo_permisos` ON `tipo_permisos`.`idTipoPermiso` = `saldos_personal`.`idTipoPermiso`
ORDER BY `permisos_personal`.`idSaldoPersonal` ASC, `permisos_personal`.`idPermisoPersonal` ASC, `permisos_personal`.`fechaCreacion` DESC