app/Models/ProductosRequisicionModel.php

SELECT `fechaRequisicion`, `comidaPreparar`, `responsableEntrega`, `responsableRecibe`, `estado`
FROM `productos_requisicion`
WHERE `fechaRequisicion` = '2024-09-07'
---
public function getRequisicionByFecha($fecha)
{
    try {
        $result = $this->select('idProductoRequisicion, fechaRequisicion, comidaPreparar , responsableEntrega, responsableRecibe, estado')
                       ->where('fechaRequisicion', $fecha)
                       ->findAll();

SELECT COUNT(*) AS `numrows`
FROM `productos_requisicion`
WHERE `fechaRequisicion` = '2024-09-07'
---
public function getRequisicionCountByFecha($fecha_solicitud)
{
    return $this->where('fechaRequisicion', $fecha_solicitud)
                ->countAllResults();