app/Models/ProductoModel.php

    public function getTiposProducto()
    {
        return $this->db->table('tipo_producto')->get()->getResult();
---
SELECT *
FROM `tipo_producto`

    public function getUnidadIndividual()
    {
        return $this->db->table('unidad_individual')->get()->getResult();
---
SELECT *
FROM `unidad_individual`

    public function getUnidadesPorCaja()
    {
        return $this->db->table('unidades_por_caja')->get()->getResult();
---
SELECT *
FROM `unidades_por_caja`

    public function getPrioridades()
    {
        return $this->db->table('nivel_prioridad')->get()->getResult();
---
SELECT *
FROM `nivel_prioridad`

    public function getDetallesSolicitados()
    {
        return $this->db->table('detalle_solicitud')->get()->getResult();
---
SELECT *
FROM `detalle_solicitud`