app/Models/ResponsableAlumnoModel.php

    public function getAlumnosAsociados($padreId)
    {
        return $this->db->table($this->table)
            ->where('idDatosResponsable', $padreId)
            ->join('datos_alumnos', 'responsable_alumno.idAlumno = datos_alumnos.idAlumno')
            ->get()
            ->getResultArray();
---
SELECT *
FROM `responsable_alumno`
JOIN `datos_alumnos` ON `datos_alumnos`.`idAlumno` = `responsable_alumno`.`idAlumno`
WHERE `responsable_alumno`.`idDatosResponsable` = '17'