app/Models/SolicitudProductosModel.php

SELECT *
FROM `solicitud_productos`
WHERE `Fecha_solicitud` >= '2024-08-01'
AND `Fecha_solicitud` <= '2024-08-01'
---
    public function getReporteSolicitudProductos($fechaInicio = null, $fechaFin = null)
{
    $builder = $this->builder();

    if ($fechaInicio && $fechaFin) {
        $builder->where('Fecha_solicitud >=', $fechaInicio);
        $builder->where('Fecha_solicitud <=', $fechaFin);
    } elseif ($fechaInicio) {
        $builder->where('Fecha_solicitud', $fechaInicio); // Si solo se especifica una fecha, filtra por esa fecha
    }

    return $builder->get()->getResultArray();