app/Models/TipoDocumentoModel.php

    public function getTiposDocumento()
    {
        return $this->findAll();
---
SELECT *
FROM `tipo_documento`

    public function getTipoDocumentoById($id)
    {
        return $this->where('idTipoDocumento', $id)->first();
---
SELECT *
FROM `tipo_documento`
WHERE `idTipoDocumento` = '3'
 LIMIT 1

    public function updateTipoDocumento($id, $data)
    {
        return $this->update($id, $data);
---
UPDATE `tipo_documento` SET `nombre` = 'NIT', `mascara` = '####-######-###-##', `usuarioModifica` = 'febe'
WHERE `tipo_documento`.`idTipoDocumento` IN ('3')