app/Models/TipoPermisoModel.php

SELECT `idTipoPermiso`, `nombre`, `cantidadDias`, `estado`
FROM `tipo_permisos`
WHERE `estado` = 'Activo'
ORDER BY `nombre`
---
    public function getAllTipoPermisos()
    {
        $builder = $this->db->table('tipo_permisos');
        $builder->select('idTipoPermiso, nombre, cantidadDias, estado');
        $builder->where('estado', 'Activo');  // Filtrar solo los activos
        $builder->orderBy('nombre');
        return $builder->get()->getResultArray();